Оборудование/src/Documents/ВозвратСРемонта/ВозвратСРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратСРемонта</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Куда</name>
    <type>
      <types>CatalogRef.Субъекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьРемонта</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Оборудование/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оборудование/src/AccumulationRegisters/Остатки/Остатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Остатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.Субъекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оборудование/src/Documents/ВозвратСРемонта/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Расходы Приход
	Движения.Расходы.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьРемонта Из ПереченьРемонта Цикл
		Движение = Движения.Расходы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПереченьРемонта.ВидРемонта;
		Движение.Цена = ТекСтрокаПереченьРемонта.Цена;
	КонецЦикла;

	// регистр Остатки Приход
	Движения.Остатки.Записывать = Истина;
	Движение = Движения.Остатки.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = Номенклатура;
	Движение.Субъект = Куда;
	Движение.Количество = 1;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
